{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vocab_embed_weight", 
      "attrs": {
        "input_dim": "7493", 
        "output_dim": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "vocab_embed", 
      "attrs": {
        "input_dim": "7493", 
        "output_dim": "200"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(20, 1, 119, 200)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attrs": {
        "kernel": "(2, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution16_bias", 
      "attrs": {
        "kernel": "(2, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "kernel": "(2, 200)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling16", 
      "attrs": {
        "kernel": "(118, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attrs": {
        "kernel": "(3, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution17_bias", 
      "attrs": {
        "kernel": "(3, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "kernel": "(3, 200)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling17", 
      "attrs": {
        "kernel": "(117, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attrs": {
        "kernel": "(4, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution18_bias", 
      "attrs": {
        "kernel": "(4, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "kernel": "(4, 200)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling18", 
      "attrs": {
        "kernel": "(116, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attrs": {
        "kernel": "(5, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution19_bias", 
      "attrs": {
        "kernel": "(5, 200)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "kernel": "(5, 200)", 
        "num_filter": "100"
      }, 
      "inputs": [[3, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling19", 
      "attrs": {
        "kernel": "(115, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[8, 0, 0], [13, 0, 0], [18, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(20, 400)"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "class_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "class_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    5, 
    9, 
    10, 
    14, 
    15, 
    19, 
    20, 
    26, 
    27, 
    29
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35
  ], 
  "heads": [[30, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10201]}
}